# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Brews (Packages)
brew "bat"
brew "exa"
brew "gh"
brew "git"
brew "htop"
brew "httpie"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "zsh"

# Casks (Applications)
cask "1password"
cask "alfred"
cask "bartender"
cask "chromedriver"
cask "docker"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "github"
cask "google-chrome"
cask "istat-menus"
cask "iterm2"
cask "keka"
cask "micromamba"
cask "moom"
cask "pdf-expert"
cask "spotify"
cask "the-unarchiver"
cask "ticktick"
cask "visual-studio-code"
cask "wechat"

