###############################################################################
# Taps
###############################################################################
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "jesseduffield/lazygit"

###############################################################################
# Brews (Packages)
###############################################################################
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern replacement for 'ls'
brew "exa"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# UNIX shell (command interpreter)
brew "zsh"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"

###############################################################################
# Casks (Applications)
###############################################################################
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Menu bar icon organizer
cask "bartender"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File archiver
cask "keka"
# Minimal installer for conda
cask "miniconda"
# Replacement for Docker Desktop
cask "orbstack"
# PDF reader, editor and annotator
cask "pdf-expert"
# Music streaming service
cask "spotify"
# Unpacks archive files
cask "the-unarchiver"
# To-do & task list manager
cask "ticktick"
# Open-source code editor
cask "visual-studio-code"
# Free messaging and calling application
cask "wechat"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Calendar for professionals and teams
cask "cron"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Per-app audio controls
cask "sound-control"
# Collect, organize, cite, and share research sources
cask "zotero"
# Mesh VPN based on Wireguard
cask "tailscale"
